post/resource.tex
% Created 2019-01-02 Wed 02:00
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Guanqun Yang}
\date{12/28/2018}
\title{Research Resources Repository}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{Introduction}
\label{sec-1}
As a person who loves to keep everything organized, I sometimes find it insufficient
to keep relevant resources in bookmark bar since I, with high probability, will end up
forgetting they are there and wasting time discover them repeatedly. Therefore, I decide
to set up this repository to stash the gems I find during daily learning and research.

The organization of this repository follows five topics I listed in prologue plus two 
additional non-technical topics
\begin{enumerate}
\item General articles on research, career and life I find beneficial. Note even for non-English
articles, I will generally use their (probably inaccurate) English translation since Emacs does not
support efficient non-English (especially Chinese) input.
\item Research tools/softwares not listed in \href{https://github.com/emptymalei/awesome-research}{Awesome Research Tools} created by Lei Ma, whose
notes on his/her statistical physics courses motivated me to create this whole set of notes.
\end{enumerate}

\section{Linear Algebra}
\label{sec-2}

\begin{itemize}
\item \href{http://web.stanford.edu/~jduchi/projects/general_notes.pdf}{Derivations for Linear Algebra and Optimization} by John Duchi
\end{itemize}
\section{Convex Optimization}
\label{sec-3}

\begin{itemize}
\item \href{http://web.stanford.edu/~jduchi/projects/general_notes.pdf}{Derivations for Linear Algebra and Optimization} by John Duchi
\end{itemize}
\section{Machine Learning}
\label{sec-4}

\section{Deep Learning}
\label{sec-5}
\begin{itemize}
\item \href{https://github.com/floodsung/Deep-Learning-Papers-Reading-Roadmap}{Deep Learning Papers Reading Roadmap}
\begin{itemize}
\item A comprensive collection of papers includeing basics, methods and applications.
\item \href{https://github.com/LuckyZXL2016/Deep-Learning-Papers-Reading-Roadmap}{Paper repository} of the papers listed on this roadmap.
\end{itemize}
\item \href{https://github.com/terryum/awesome-deep-learning-papers}{Awesome - Most Cited Deep Learning Papers}
\begin{itemize}
\item A collection of papers \textbf{by topic} from 2012 to 2016 selected
according to their number of citations. This list could be used in companion with the previous one, 
especially when reading papers from the methods and applications section.
\item A \href{https://github.com/terryum/awesome-deep-learning-papers/blob/master/fetch_papers.py}{Python script} that could download all the papers in the list.
\end{itemize}
\item \href{https://github.com/kjw0612/awesome-deep-vision}{Awesome Deep Vision}
\begin{itemize}
\item A list of papers (by topic), courses, books and many other resources of computer
vision using deep learning methods.
\end{itemize}
\item \href{https://github.com/jbhuang0604/awesome-computer-vision}{Awesome Computer Vision}
\begin{itemize}
\item A pretty extensive list that includes resources not only in computer vision, but also
\href{https://github.com/jbhuang0604/awesome-computer-vision#resources-for-students}{resources for students}, like writing and presenting.
\end{itemize}
\item \href{https://github.com/jbhuang0604/awesome-computer-vision/blob/master/people.md}{Academic Genealogy in Computer Vision}
\item \href{https://github.com/kjw0612/awesome-rnn}{Awesome Recurrent Neural Networks}
\end{itemize}
\section{My Current Research}
\label{sec-6}

\section{General Articles}
\label{sec-7}
\subsection{Uncategorized}
\label{sec-7-1}
\begin{itemize}
\item \href{http://www.adoctorateandbeyond.com/}{A Doctorate and Beyond: Building a Career in Engineering and the Physical Sciences}
\end{itemize}
\subsection{Writing and Presenting}
\label{sec-7-2}
\subsubsection{Techniques}
\label{sec-7-2-1}
\begin{itemize}
\item \href{http://pgbovine.net/email-tips.htm}{Email Writing Tips} by Philip Guo
\item \href{https://sites.math.washington.edu/~lee/Writing/writing-proofs.pdf}{Some Remarks on Writing Mathematical Proofs} by John M. Lee

Some concensus and conventions of writing proofs in mathematical community.
\item \emph{Air \& Light \& Time \& Space - How Successful Academics Write} by Helen Sword
\begin{itemize}
\item Interviews of one hundred scholars around world with different backgrounds who thrive
in the publish-or-perish environment.
\end{itemize}
\end{itemize}
\subsubsection{Tools}
\label{sec-7-2-2}
\begin{itemize}
\item \href{https://thepresentationdesigner.co.uk/5-classic-presentation-fonts/}{5 Classic Presentation Fonts}
\begin{itemize}
\item Five fonts (\verb~Helvetica~, \verb~Garamond~ and others)  and their history well-suited for presentation. To use
the fonts mentioned, go to \href{https://tex.stackexchange.com/questions/121061/working-with-arial-or-helvetica-fonts}{here (for Helvetica)} or \href{https://tex.stackexchange.com/questions/406816/how-can-i-get-a-garamond-font}{here (for Garamond)}.
\end{itemize}
\end{itemize}




\subsection{PhD Application}
\label{sec-7-3}
\begin{itemize}
\item \href{http://pgbovine.net/PhD-application-tips.htm}{A Five-Minute Guide to Ph.D. Program Applications} by Philip Guo
\begin{itemize}
\item Some templates of SOPs could be found \href{http://pgbovine.net/PhD-application-essay-examples.htm}{here}.
\end{itemize}
\end{itemize}
\subsection{PhD Life}
\label{sec-7-4}
\begin{itemize}
\item \href{https://zhuanlan.zhihu.com/p/50597445}{My eight years of doing PhD - Academics} by \href{http://www.cs.cmu.edu/~yunwang/}{Dr. Yun Wang} (in Chinese)
\item \href{https://zhuanlan.zhihu.com/p/50667670}{My eight years of doing PhD - Fun} by  \href{http://www.cs.cmu.edu/~yunwang/}{Dr. Yun Wang} (in Chinese)
\item \href{https://mp.weixin.qq.com/s?__biz=MzI1OTA4Mjk3NA==&mid=2650830984&idx=1&sn=f963f564dfe1e01996e3c4545fd5c793}{How to be a happy and productive writer} by \href{https://sociology.ubc.ca/profile/yue-qian/}{Dr. Qian Yue} (in Chinese)
\begin{itemize}
\item Note: This is a verbatim of a workshop mainly discussing reading-writing cycle
for PhD research in sociology. Even though the voices come from a different
discipline than engineering, the methology, to my opinion, is largely the same and
feels relatable to my personal experiences.
\item Her \href{https://www.weibo.com/p/1001603935693545055068}{weibo post} on the same topic, but in more details (in Chinese).
\end{itemize}
\item \href{https://mp.weixin.qq.com/s/50iNupppOyGLDt4cJmYk3Q}{How to manage your time, emotion, research progress as re-tenure faculty members?} by \href{https://sociology.ubc.ca/profile/yue-qian/}{Dr. Qian Yue} (in Chinese)
\begin{itemize}
\item Note: This is an article talking about the author's first year as an assistant professor in sociology.
Although I am currently still a student, the time/emotion  management part is pretty useful. At the same time, 
since we are both abroad, the feelings about life in a different country somehow synchronize.
\end{itemize}
\end{itemize}

\subsection{Career}
\label{sec-7-5}


\section{Research Tools}
\label{sec-8}
\subsection{Commenting LaTex Articles}
\label{sec-8-1}
\begin{itemize}
\item \href{http://ftp.math.purdue.edu/mirrors/ctan.org/support/latexdiff/doc/latexdiff-man.pdf}{latexdiff}

It is a Perl script that compares the differences of two \verb~.tex~ source files
and marks the significant differences between them, which could be used for
commenting manuscripts.
\item Using Git

See \href{https://www.zhihu.com/question/22316670/answer/131793794}{this post} (in Chinese), which utilizes git to do version control on manuscripts. But this seems to be useful
for individual person who is working on notes rather than collaboration on papers.
\item Direct conversion to MSWord readable format
\begin{itemize}
\item latex2rtf: convert to \verb~.rtf~ file.
\item \href{https://pandoc.org/MANUAL.html}{pandoc}: convert to \verb~.odt~ file.
\item More solutions could be found \href{https://tex.stackexchange.com/questions/111886/how-to-convert-a-scientific-manuscript-from-latex-to-word-using-pandoc}{here}.
\end{itemize}
\item Using Overleaf
\end{itemize}
\subsection{Visualizing Data}
\label{sec-8-2}
\begin{itemize}
\item \emph{Handbook of Data Visualization} by \href{http://www3.stat.sinica.edu.tw/library/anniversary/people/faculty/faculty_cchen.htm}{Dr. Chun-Houh Chen} 

A good starting point to choose the appropriate format to 
present complex relations among variables using graph. An example
to visualize 20 variables done by author's group could be found \href{http://gap.stat.sinica.edu.tw/3476.pdf}{here}
(in Chinese).
\end{itemize}
\section{Coding}
\label{sec-9}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
